Repository: enekor/Gastoscopio
Catalog: lib/l10n/app_*.arb
Languages: es

# biometricAuthFailed
source: Biometric authentication failed
es: Autenticación biométrica fallida

# showSummary
source: Monthly insights.
es: ¿Cómo ha ido el mes?

# confrmTagDelete
source: Delete categories
es: Borrar categorias

# confirmDeleteAllTags
source: Do you want to delete all the tags from this month's movements?
es: ¿Quieres borrar las categorias de los movimientos de este mes?

# migrateMonth
source: Migrate to another month
es: Migrar a otro mes

# selectMonthToMigrate
source: It only takes the month, not the selected day
es: Solo se cogerá el mes, no el dia seleccinado

source: Savings
es: Ahorros
