Repository: enekor/Gastoscopio
Catalog: lib/l10n/app_*.arb
Languages: es

source: Home
es: Inicio

source: Movements
es: Movimientos

source: Summary
es: Resumen

source: AI Analysis
es: Análisis IA

source: Monthly Summary
es: Resumen del Mes

# youSpentPercent
source: You have spent {percent}% of your income
es: Has gastado el {percent}% de tus ingresos

# categoryDistribution
source: Expense Distribution by Category
es: Distribución de Gastos por Categoría

source: Daily Expenses
es: Gastos Diarios

# aiAnalysisTitle
source: Expense Analysis
es: Análisis de Gastos

source: Generate
es: Generar

# generateAnalysisHint
source: Press the "Generate Analysis" button to get a detailed analysis of your expenses and income for this month.
es: Pulsa el botón "Generar Análisis" para obtener un análisis detallado de tus gastos e ingresos de este mes.

# noDataForMonth
source: No data for {year} - {month}
es: No hay datos para {month} - {year}

# dataWillAppear
source: Data will appear here when you add at least 5 movements.
es: Los datos aparecerán aquí cuando agregues mínimo 5 movimientos.

source: Settings
es: Configuración

source: New Expense
es: Nuevo Gasto

source: New Income
es: Nuevo Ingreso

source: Expense
es: Gasto

source: Income
es: Ingreso

source: Description
es: Descripción

source: Amount
es: Monto

source: Date
es: Fecha

source: Save
es: Guardar

source: Cancel
es: Cancelar

source: Accept
es: Aceptar

source: Edit
es: Editar

source: Delete
es: Eliminar

source: Add
es: Añadir

source: Select date
es: Seleccionar fecha

source: Language
es: Idioma

source: System language
es: Idioma del sistema

# currency
source: Preferred Currency
es: Moneda Preferida

source: Navigation Style
es: Estilo de Navegación

# transparentNavigation
source: Transparent
es: Transparente

# opaqueNavigation
source: Opaque
es: Opaca

# pleaseEnterDescription
source: Please enter a description
es: Por favor ingrese una descripción

# pleaseEnterAmount
source: Please enter an amount
es: Por favor ingrese un monto

# pleaseEnterValidAmount
source: Please enter a valid amount
es: Por favor ingrese un monto válido

# dateUpdatedToDay
source: Date updated to day {day}
es: Fecha actualizada al día {day}

# errorUpdatingDate
source: Error updating date: {error}
es: Error al actualizar la fecha: {error}

source: ✅ Movement saved
es: ✅ Movimiento guardado

source: ✅ Movement updated
es: ✅ Movimiento actualizado

source: Saving...
es: Guardando...

# sortByDate
source: By date
es: Por fecha

# sortByAmount
source: By amount
es: Por monto

# sortByCategory
source: By category
es: Por categoría

source: Personalization
es: Personalización

# personalizationSubtitle
source: Configure your app experience.
es: Configura tu experiencia en la aplicación.

# languageDescription
source: Select the app language. Choosing "System language" will use your Android language setting.
es: Selecciona el idioma de la aplicación. Al elegir "Idioma del sistema", la app usará el idioma configurado en Android.

# currencyDescription
source: Select the currency to display throughout the app.
es: Selecciona la moneda que se mostrará en toda la aplicación.

source: Logo Personalization.
es: Personalización del Logo.

# logoDescription
source: Choose between static PNG or customizable SVG with color.
es: Elige entre PNG estático o SVG personalizable con color.

# navigationStyleDescription
source: Customize the bottom navigation bar appearance.
es: Personaliza la apariencia de la barra de navegación inferior.

source: Artificial Intelligence
es: Inteligencia Artificial

# aiDescription
source: Configuration for advanced AI features.
es: Configuración para funciones avanzadas con IA.

source: Backup Management
es: Gestión de copia de seguridad

# backupDescription
source: Import and export your data.
es: Importa y exporta tus datos.

# languageUpdated
source: Language updated successfully
es: Idioma actualizado correctamente

# errorChangingLanguage
source: Error changing language: {error}
es: Error al cambiar idioma: {error}

# currencyUpdated
source: Currency updated successfully
es: Moneda actualizada correctamente

# logoUpdated
source: Logo updated successfully
es: Logo actualizado correctamente

# avatarColorUpdated
source: Avatar color updated successfully
es: Color de avatar actualizado correctamente

# transparentBottomNav
source: Transparent bottom navigation applied
es: Navegación inferior transparente aplicada

# opaqueBottomNav
source: Opaque bottom navigation applied
es: Navegación inferior opaca aplicada

# staticLabel
source: Static
es: Estático

# customizableLabel
source: Customizable
es: Personalizable

# svgColorLabel
source: SVG Logo Color.
es: Color del Logo SVG.

# selectColor
source: Select a Color
es: Selecciona un Color

source: Apply
es: Aplicar

source: Solid background
es: Fondo sólido

source: Glass effect
es: Efecto cristal

source: Loading...
es: Cargando...

# manageRecurringMovements
source: Recurring
es: Gestionar Movimientos Recurrentes

source: No movements to show.
es: No hay movimientos para mostrar.

source: Incomes
es: Ingresos

source: Expenses
es: Gastos

source: Month Balance
es: Balance del mes

source: Expenses by Category
es: Gastos por Categoría

# noTagsGenerated
source: Could not generate tags for movements. Try again later or check the API key provided in settings.
es: No se pudieron generar etiquetas para los movimientos. Intente de nuevo más tarde o revise la API key proporcionada en ajustes.

source: Sort by
es: Ordenar por

source: By date
es: Por fecha

source: Alphabetical
es: Alfabético

source: By value
es: Por valor

source: Clear sort
es: Limpiar orden

source: Generate tags automatically
es: Generar etiquetas automáticamente

source: Filtered movements:
es: Movimientos filtrados:

source: Total movements:
es: Total de movimientos:

source: No expenses.
es: No hay gastos.

source: No incomes.
es: No hay ingresos.

# pleaseEnterValidAmountGreaterThanZero
source: Please enter a valid amount greater than 0
es: Por favor, introduce un monto válido mayor que 0

# categoryNotGenerated
source: Could not generate category, will be saved with empty category. You can assign it manually later.
es: No se pudo generar la categoría, se guardará con categoría vacía. Puedes asignarla manualmente más tarde.

# errorGeneratingCategory
source: Error generating category. Will be saved without category.
es: Error al generar categoría. Se guardará sin categoría.

source: Movement updated successfully
es: Movimiento actualizado con éxito

source: Movement saved successfully
es: Movimiento guardado con éxito

source: Unknown error
es: Error desconocido

source: General error
es: Error general

source: Database error
es: Error de base de datos

# databaseErrorMessage
source: Could not access database. Check that you have enough storage space on the device.
es: No se pudo acceder a la base de datos. Verifica que tengas espacio suficiente en el dispositivo.

source: Format error
es: Error de formato

# formatErrorMessage
source: Amount format is invalid. Use numbers with dot or comma as decimal.
es: El formato del monto no es válido. Usa números con punto o coma como decimal.

source: Connection error
es: Error de conexión

# connectionErrorMessage
source: No internet connection. Movement will be saved without automatic category.
es: Sin conexión a internet. El movimiento se guardará sin categoría automática.

source: Permission error
es: Error de permisos

# permissionErrorMessage
source: App doesn't have permission to save data. Check app permissions.
es: La aplicación no tiene permisos para guardar datos. Verifica los permisos de la app.

source: No data to import
es: No hay datos para importar

source: Importing data...
es: Importando datos...

# savingMovements
source: Saving {count} movements
es: Guardando {count} movimientos

# dataImportedSuccessfully
source: Data has been imported successfully
es: Los datos se han importado correctamente

# errorSavingData
source: An error occurred while saving data
es: Ocurrió un error al guardar los datos

# databaseInitializationError
source: Error initializing database. Please try again.
es: Error al inicializar la base de datos. Por favor, intenta de nuevo.

# dataFormatError
source: Error saving data. Check that the file format is correct.
es: Error al guardar los datos. Verifica que el formato del archivo sea correcto.

source: Import Error
es: Error al importar

source: Continue without importing
es: Continuar sin importar

source: Try again
es: Intentar de nuevo

# dollarSymbol
source: US Dollar ($)
es: Dólar Estadounidense ($)

# poundSymbol
source: British Pound (£)
es: Libra Esterlina (£)

# yenSymbol
source: Japanese Yen (¥)
es: Yen Japonés (¥)

# swissFrancSymbol
source: Swiss Franc (CHF)
es: Franco Suizo (CHF)

# colombianPesoSymbol
source: Colombian Peso (COP)
es: Peso Colombiano (COP)

source: Fixed Movements
es: Movimientos Fijos

source: Automatic Movements
es: Movimientos Automáticos

# addedAutomaticallyEachMonth
source: Added automatically each new month.
es: Se añaden automáticamente cada mes nuevo.

source: No fixed movements
es: Sin movimientos fijos

# createRecurringMovements
source: Create movements that repeat automatically each month, like salaries, rent or subscriptions.
es: Crea movimientos que se repitan automáticamente cada mes, como salarios, alquileres o suscripciones.

source: Create first movement.
es: Crear primer movimiento.

# dayOfEachMonth
source: Day {day} of each month
es: Día {day} de cada mes

# movementDeleted
source: Movement "{description}" deleted.
es: Movimiento "{description}" eliminado.

# errorLoadingMovements
source: Error loading movements: {error}
es: Error al cargar movimientos: {error}

# errorCreatingMovement
source: Error creating movement: {error}
es: Error al crear movimiento: {error}

# errorDeletingMovement
source: Error deleting movement: {error}
es: Error al eliminar movimiento: {error}

# errorUpdatingMovement
source: Error updating movement: {error}
es: Error al actualizar movimiento: {error}

source: New Fixed Movement
es: Nuevo Movimiento Fijo

source: Edit Movement
es: Editar Movimiento

# descriptionRequired
source: Description is required
es: La descripción es obligatoria

# amountRequired
source: Amount is required.
es: La cantidad es obligatoria.

# enterValidNumber
source: Enter a valid number.
es: Introduce un número válido.

# amountMustBeGreaterThanZero
source: Amount must be greater than 0.
es: La cantidad debe ser mayor que 0.

# quantity
source: Amount
es: Cantidad

source: Day of month
es: Día del mes

source: From 1 to 31
es: Del 1 al 31

# dayRequired
source: Day is required
es: El día es obligatorio

source: Day must be between 1 and 31.
es: El día debe estar entre 1 y 31.

source: Movement type
es: Tipo de movimiento

# saveInCurrentMonth
source: Save expense in current month:
es: Guardar gasto en mes actual:

source: Create
es: Crear

# errorInData
source: Error in data: {error}
es: Error en los datos: {error}

# exampleSalaryRentNetflix
source: E.g: Salary, Rent, Netflix...
es: Ej: Salario, Alquiler, Netflix...

source: Good morning
es: Buenos días

source: Good afternoon
es: Buenas tardes

source: Good evening
es: Buenas noches

# startDayWithEnergy
source: Start the day with renewed energy.
es: Comienza el día con energía renovada.

# keepBuildingFinancialFuture
source: Keep building your financial future.
es: Sigue construyendo tu futuro financiero.

# perfectTimeToReviewFinances
source: Perfect time to review your finances.
es: Momento perfecto para revisar tus finanzas.

source: Filters
es: Filtros

# lastMovements
source: Recent movements
es: Últimos movimientos

source: All
es: Todos

source: Search
es: Buscar

source: All categories
es: Todas las categorías

# pleaseEnterValidNumber
source: Please enter a valid number
es: Por favor, ingresa un número válido.

# dateLabel
source: Date
es: Fecha:

source: Delete Movement
es: ¿Eliminar movimiento?

# confirmDeleteMovement
source: Are you sure you want to delete this movement?
es: ¿Estás seguro de que quieres eliminar "{description}"?

source: Change Category
es: Cambiar categoría

source: Select Category
es: Selecciona una categoría

# categoryUpdated
source: Category updated successfully
es: Categoría actualizada: {category}.

source: Eliminated successfully
es: eliminado con éxito

# elimError
source: Error deleting
es: Error al eliminar

# currencyChangedSuccessfully
source: Currency updated successfully
es: Moneda actualizada correctamente

# logoChangedSuccessfully
source: Logo updated successfully
es: Logo actualizado correctamente

# avatarColorChangedSuccessfully
source: Avatar color updated successfully
es: Color de avatar actualizado correctamente

# transparentBottomNavApplied
source: Transparent bottom navigation applied
es: Navegación inferior transparente aplicada

# opaqueBottomNavApplied
source: Opaque bottom navigation applied
es: Navegación inferior opaca aplicada

# languageChangedSuccessfully
source: Language updated successfully
es: Idioma actualizado correctamente

# cantOpenUrl
source: Cannot open the link
es: No se puede abrir el enlace

# apiKeyCantBeEmpty
source: ❌ API Key cannot be empty
es: ❌ El API Key no puede estar vacío

source: ✅ API Key saved successfully
es: ✅ API Key guardada correctamente

source: API Key saved
es: API Key guardada

# importantRestart
source: IMPORTANT: For AI to work properly, you must completely restart the app.
es: IMPORTANTE: Para que la IA funcione correctamente, debes reiniciar completamente la aplicación.

# appRestartAdvice
source: 💡 Close the app completely and reopen it.
es: 💡 Cierra la app completamente y vuelve a abrirla.

# aiFeaturesActivation
source: To activate artificial intelligence features, you need to obtain a Google API key. We guide you step by step:
es: Para activar las funciones de inteligencia artificial, necesitas obtener una clave API de Google. Te guiamos paso a paso:

# step1
source: 1. Go to Google AI Studio and sign in with your account
es: 1. Accede a Google AI Studio e inicia sesión con tu cuenta

# step2
source: 2. Click on "Create API key" and copy the generated key
es: 2. Haz clic en "Crear clave de API" y copia la clave generada

# step2_1
source: 2.1. If this popup appears, close it with the X
es: 2.1. Si aparece esta ventana emergente, ciérrala con la X

# step2_2
source: 2.2. Scroll down until you find the keys table
es: 2.2. Desplázate hacia abajo hasta encontrar la tabla de claves

# step2_3
source: 2.3. Click the blue link to access the key
es: 2.3. Haz clic en el enlace azul para acceder a la clave

# step3
source: 3. Paste the API key into the app's text field
es: 3. Pega la clave API en el campo de texto de la aplicación

# step4
source: 4. Press the save button to complete the setup
es: 4. Presiona el botón guardar para completar la configuración

source: Go to Google AI Studio
es: Ir a Google AI Studio

source: Google API Key
es: Clave API de Google

source: Delete database
es: Borrar base de datos

# dbDeleteWarning
source: WARNING: This action will delete ALL app data:
es: ATENCIÓN: Esta acción eliminará TODOS los datos de la aplicación:

# dbDeleteList1
source: • All recorded movements
es: • Todos los movimientos registrados

# dbDeleteList2
source: • All custom categories
es: • Todas las categorías personalizadas

# dbDeleteList3
source: • All fixed movements
es: • Todos los movimientos fijos

# dbDeleteList4
source: • Color settings and preferences
es: • Configuración de colores y preferencias

# dbDeleteUnrecoverable
source: This action CANNOT be undone.
es: Esta acción NO se puede deshacer.

# dbDeleteRecomendation
source: 💡 Recommendation: Make a backup before continuing.
es: 💡 Recomendación: Haz un backup antes de continuar.

source: Delete All
es: Eliminar Todo

# dbDeletedSuccesfully
source: ✅ Database cleaned successfully
es: ✅ Base de datos limpiada correctamente

# dbDeleted
source: Database cleaned
es: Base de datos limpiada

# deDeletedSubtitle
source: All data has been deleted successfully.
es: Todos los datos se han eliminado correctamente.

# dbDeleteAppRestart
source: IMPORTANT: To fully apply the changes, it is recommended to restart the app.
es: IMPORTANTE: Para que los cambios se apliquen completamente, es recomendable reiniciar la aplicación.

# dbDeleteAppRestartAdvice
source: 💡 Close the app completely and reopen it.
es: 💡 Cierra la app completamente y vuelve a abrirla.

# errorCleaningDatabase
source: ❌ Error cleaning the database
es: ❌ Error al limpiar la base de datos

source: Developer Options
es: Opciones de Desarrollador

# developerOptionsSubtitle
source: Access to advanced and development features.
es: Acceso a funciones avanzadas y de desarrollo.

source: Import from JSON
es: Importar desde JSON

# importFromJsonSubtitle
source: Import data from a Gastoscopio JSON file.
es: Importa datos desde un archivo JSON de Gastoscopio.

# deleteDatabaseSubtitle
source: ⚠️ DANGER: Permanently deletes ALL app data. This action cannot be undone.
es: ⚠️ PELIGRO: Borra TODOS los datos de la aplicación de forma permanente. Esta acción no se puede deshacer.

source: Cleaning...
es: Limpiando...

source: Clean All Data
es: Limpiar Todos los Datos

source: ❌ Error saving API Key
es: No se ha podido guardar la API Key

source: Configure API Key
es: Configurar API Key

# enterApiKeyMessage
source: To use AI features, please enter your API Key:
es: Para utilizar las funciones de IA, por favor ingrese su API Key:

source: Later
es: Más tarde

source: Let's go
es: Vamos allá

# noResponseGenerated
source: Could not generate a response
es: No se pudo generar una respuesta

source: API Key not configured
es: API Key no configurada

source: No month selected
es: Mes no seleccionado

source: Create new month
es: Crear nuevo mes

# monthDoesNotExist
source: The month {month} of {year} does not exist. Would you like to create it?
es: El mes {month} de {year} no existe. ¿Deseas crearlo?

source: Yes
es: Sí

source: January
es: Enero

source: February
es: Febrero

source: March
es: Marzo

source: April
es: Abril

source: May
es: Mayo

source: June
es: Junio

source: July
es: Julio

source: August
es: Agosto

source: September
es: Septiembre

source: October
es: Octubre

source: November
es: Noviembre

source: December
es: Diciembre

source: Name
es: Nombre

# nameRequired
source: Name is required
es: El nombre es requerido

source: Invalid amount
es: Monto inválido

source: Login Required
es: Inicio de sesión requerido

# loginToAccess
source: Sign in to access this feature
es: Inicia sesión para acceder a esta función

# login
source: Sign in
es: Iniciar sesión

# logout
source: Sign out
es: Cerrar sesión

# loggedOutSuccessfully
source: Signed out successfully
es: Sesión cerrada correctamente

# loggedInSuccessfully
source: Signed in successfully
es: Sesión iniciada correctamente

# loginError
source: Sign in error
es: Error al iniciar sesión

# accountSection
source: Account
es: Cuenta

# accountDescription
source: Manage your account and sign-in options
es: Gestiona tu cuenta y las opciones de inicio de sesión

source: Future Movements
es: Movimientos futuros

# noIaFeaturesHomeTitle
source: You are missing out on the app's smart features! Enable AI to get automatic analysis, personalized suggestions, and much more. It's free and very easy to set up.
es: ¡Estás perdiendo acceso a las funciones inteligentes de la app! Activa la IA para obtener análisis automáticos, sugerencias personalizadas y mucho más. Es gratuito y muy facil de configurar.

# noIaFeaturesHomeSubtitle
source: Discover smart analysis, recommendations and more. Tap to learn how to enable AI features.
es: Para activar las funciones IA, ve a Ajustes > Sección IA y sigue los pasos para introducir tu API Key.

# activateIaFeatures
source: Enable AI Features!
es: ¡Activa las funciones IA!

# iaFeaturesText
source: AI features
es: Funciones de IA

source: Security
es: Seguridad

# securityDescription
source: Configure app access security features.
es: Configura las funciones de seguridad de acceso a la app.

# useAppLock
source: Enable app lock
es: Activar bloqueo de la app

# useAppLockDescription
source: Require authentication to access the app.
es: Requiere autenticación para acceder a la app.

source: Use biometrics
es: Usar biometría

# useBiometricsDescription
source: Use fingerprint or face recognition to unlock.
es: Utiliza huella digital o reconocimiento facial para desbloquear.

source: Enter PIN
es: Introduce el PIN

# enterPinToAccess
source: Enter PIN to access the app
es: Introduce el PIN para acceder a la app

# enterPinSetup
source: Enter a 4-digit PIN to secure your app
es: Introduce un PIN de 4 dígitos para proteger tu app

source: Setup PIN
es: Configurar PIN

source: Change PIN
es: Cambiar PIN

# changePinDescription
source: Change your security PIN code
es: Cambia tu código PIN de seguridad

# invalidPin
source: Invalid PIN code
es: Código PIN inválido

# pinSetupSuccess
source: PIN setup successfully
es: PIN configurado correctamente

source: Verify
es: Verificar

# welcome
source: Welcome to Cashly
es: Bienvenido a Cashly

# welcomeSubtitle
source: Your personal finance companion
es: Tu compañero de finanzas personales

source: Get Started
es: Comenzar

source: Next
es: Siguiente

source: Skip
es: Saltar

source: Finish
es: Finalizar

# onboardingStep1Title
source: Track Your Finances
es: Controla tus Finanzas

# onboardingStep1Desc
source: Keep track of your income and expenses easily
es: Mantén un registro de tus ingresos y gastos fácilmente

# onboardingStep2Title
source: Smart Analytics
es: Análisis Inteligente

# onboardingStep2Desc
source: Get insights about your spending habits with AI assistance
es: Obtén información sobre tus hábitos de gasto con ayuda de IA

# onboardingStep3Title
source: Secure and Private
es: Seguro y Privado

# onboardingStep3Desc
source: Your data stays on your device, protected and private
es: Tus datos permanecen en tu dispositivo, protegidos y privados

source: Terms and Conditions
es: Términos y Condiciones

# agreeToTerms
source: I agree to the Terms and Conditions
es: Acepto los Términos y Condiciones

# pleaseAgreeToTerms
source: Please agree to the Terms and Conditions to continue
es: Por favor acepta los Términos y Condiciones para continuar

# configureGeminiApiKey
source: Configure your Gemini API Key
es: Configura tu API Key de Gemini

# apiKeyRequired
source: API Key is required for AI features. It's free and easy to obtain.
es: La API Key es necesaria para utilizar las funciones de IA. Es gratis y fácil de obtener.

# continueAction
source: Continue
es: Continuar

# welcomeToApp
source: Welcome to Cashly
es: Bienvenido a Gastoscopio

# connectGoogleAccount
source: Connect your Google account to sync and backup your financial data
es: Conecta tu cuenta de Google para sincronizar y respaldar tus datos financieros

source: No account connected
es: Sin cuenta conectada

# loginForBackupSync
source: Sign in with Google to access backup and sync features
es: Inicia sesión con Google para acceder a funciones de respaldo y sincronización

# correctlyConnected
source: Successfully connected
es: Conectado correctamente

source: User
es: Usuario

source: Sign in with Google
es: Iniciar sesión con Google

# optionalLogin
source: Optional: You can continue without an account, but you won't have access to backup features.
es: Opcional: Puedes continuar sin cuenta, pero no tendrás acceso a funciones de respaldo.

# continueWithoutLogin
source: Continue without signing in
es: Continuar sin iniciar sesión

source: Continue to next step
es: Continuar al siguiente paso

# signOut
source: Sign in out
es: Cerrar sesión

source: Signing in...
es: Iniciando sesión...

source: Signing out...
es: Cerrando sesión...

# authenticateToAccess
source: Please authenticate to access the app
es: Por favor, autentícate para acceder a la aplicación
